Revit 2027 API
ElectricalDemandFactorDefinition.ClearValues Method
 Clears all the values stored for this demand factor definition.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ClearValues()
Public Sub ClearValues
public:
void ClearValues()
member ClearValues : unit -> unit
See Also
Reference
ElectricalDemandFactorDefinition Class
Autodesk.Revit.DB.Electrical Namespace